# Assignment 2

**Due by November 6, 2022, 23:59:59.**

Rename the notebook (.ipynb file) to "Assignment2_firstname_lastname". Send to rubing.shen@sciencespo.fr

## Olympic Games Data Analysis (1896-2016)

In this exercise, you will analyze a historical dataset on the modern Olympic Games, including all the Games from Athens 1896 to Rio 2016. 

The file `athlete_events.csv` contains 271116 rows and 15 columns. Each row corresponds to an individual athlete competing in an individual Olympic event (athlete-events). The columns are:

1. ID: Unique number for each athlete
2. Name: Athlete's name
3. Sex: M or F
4. Age: Integer
5. Height: In centimeters
6. Weight: In kilograms
7. Team: Team name (with today's country names)
8. NOC: National Olympic Committee 3-letter code
9. Games: Year and season
10. Year: Integer
11. Season: Summer or Winter
12. City: Host city
13. Sport: Sport
14. Event: Event
15. Medal: Gold, Silver, Bronze, or NA

In [42]:
import pandas as pd

In [43]:
df = pd.read_csv('./athlete_events.csv')
df.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

### Q.1 
How many different athletes have participated in the Olympic Games from 1896 to 2016? How many male athletes? How many female athletes?

In [44]:
unique_names= df['Name'].unique()
print(unique_names.shape)
unique_names= df.drop_duplicates(subset=['Name'])
print(unique_names['Sex'].value_counts())

# There were 134732 different athletes who ave participated in the Olympic Games from 1896 to 2016, out of which 100953 were male and 33779-female.

(134732,)
M    100953
F     33779
Name: Sex, dtype: int64

### Q.2
What percentage of the participants in the Summer Olympics are women? And for the Winter Olympic Games?

In [45]:
summer_olympics=df.loc[df.Season=='Summer']
print(summer_olympics['Sex'].value_counts())
summer_proportion=100*(59443/(163109+59443))
print(f'{summer_proportion}% participants in Summer Olympic Games are women')

M    163109
F     59443
Name: Sex, dtype: int64
26.709712786225243% participants in Summer Olympic Games are women

In [46]:
winter_olympics=df.loc[df.Season=='Winter']
print(winter_olympics['Sex'].value_counts())
winter_proportion=100*(15079/(15079+33485))
print(f'{winter_proportion}% of participants in Winter Olympic Games are women')

M    33485
F    15079
Name: Sex, dtype: int64
31.04974878510831% of participants in Winter Olympic Games are women

### Q.3
Give the list of cities (without duplication) that have hosted the Olympic Games (summer or winter).

In [47]:
unique_cities= df['City'].unique()
print(unique_cities)

['Barcelona' 'London' 'Antwerpen' 'Paris' 'Calgary' 'Albertville'
 'Lillehammer' 'Los Angeles' 'Salt Lake City' 'Helsinki' 'Lake Placid'
 'Sydney' 'Atlanta' 'Stockholm' 'Sochi' 'Nagano' 'Torino' 'Beijing'
 'Rio de Janeiro' 'Athina' 'Squaw Valley' 'Innsbruck' 'Sarajevo'
 'Mexico City' 'Munich' 'Seoul' 'Berlin' 'Oslo' "Cortina d'Ampezzo"
 'Melbourne' 'Roma' 'Amsterdam' 'Montreal' 'Moskva' 'Tokyo' 'Vancouver'
 'Grenoble' 'Sapporo' 'Chamonix' 'St. Louis' 'Sankt Moritz'
 'Garmisch-Partenkirchen']

### Q.4 
Which cities have hosted the Olympic Games at least twice?

> **Hint**: Each row is an athletes but we would like to keep only one occurence for each Olympic game. The method `.drop_duplicates()` allows to do that by droping all redundant lines. Write your codes using the variable `year_city` thus defined.

In [48]:
year_city = df[['Year','Season','City']].drop_duplicates()
city_frequency=year_city['City'].value_counts()
city_frequency[city_frequency >=2]

London          3
Athina          3
Innsbruck       2
Sankt Moritz    2
Paris           2
Los Angeles     2
Lake Placid     2
Stockholm       2
Name: City, dtype: int64

### Q.5 
- How many gold, silver and bronze medals have been awarded in the history of the Olympic Games ? 
- How many gold, silver and bronze medals has the Team France won in the history of the Olympic Games ?

In [49]:
print(df['Medal'].value_counts())
print('There was a total of 13372 gold, 13295 silver and 13116 bronze medals')
france=df.loc[df.Team=='France']
print(france['Medal'].value_counts())
print('France won a total of 666 bronze, 610 silver and 501 gold medals')

Gold      13372
Bronze    13295
Silver    13116
Name: Medal, dtype: int64
There was a total of 13372 gold, 13295 silver and 13116 bronze medals
Bronze    666
Silver    610
Gold      501
Name: Medal, dtype: int64
France won a total of 666 bronze, 610 silver and 501 gold medals

### Q.6
In total, how many times has a female athlete won the gold medal? How many times has a male athlete won the gold medal?

In [50]:
gold=df.loc[df.Medal=='Gold']
print(gold['Sex'].value_counts())
print('Female athletes won 3747 total gold medals and male atheletes won 9625')

M    9625
F    3747
Name: Sex, dtype: int64
Female athletes won 3747 total gold medals and male atheletes won 9625

### Q.7
How many French women athletes won the gold medal at the 2016 Summer Olympic Games? French male athletes?

In [51]:
gold_french_summer_2016=df.loc[(df.Medal=='Gold')&(df.Team=='France')&(df.Season=='Summer')&(df.Year==2016)]
#since we are interested in individual athletes and not the medal count, we have to get rid of the possibility that the same athlete won more than one medal
gold_french_summer_2016_unique= gold_french_summer_2016.drop_duplicates(subset=['Name'])
print(gold_french_summer_2016['Sex'].value_counts())
print('4 French women athletes won the gold medal at the 2016 Summer Olympic Games and 16 French male athletes')

M    16
F     4
Name: Sex, dtype: int64
4 French women athletes won the gold medal at the 2016 Summer Olympic Games and 16 French male athletes

### Q.8 
- Give the top 5 athletes who have won the most gold medals, and their respective numbers of gold medals.  
- Give the top 5 athletes who have won the most medals in total (gold, silver or bronze), and their respective numbers of medals.

In [52]:
gold=df.loc[df.Medal=='Gold']
gold_by_name=gold['Name'].value_counts()
gold_by_name.nlargest(5)

Michael Fred Phelps, II           23
Raymond Clarence "Ray" Ewry       10
Mark Andrew Spitz                  9
Frederick Carlton "Carl" Lewis     9
Paavo Johannes Nurmi               9
Name: Name, dtype: int64

In [87]:
new_df=df.dropna(subset=['Medal'])
grouped=new_df['Name'].value_counts()
grouped.nlargest(5)

Michael Fred Phelps, II               28
Larysa Semenivna Latynina (Diriy-)    18
Nikolay Yefimovich Andrianov          15
Ole Einar Bjrndalen                   13
Edoardo Mangiarotti                   13
Name: Name, dtype: int64

### Q.9
For the 2008 Summer Olympic Games, which team has the youngest average age? The oldest?

In [30]:
summer_2008=df.loc[(df.Season=='Summer')&(df.Year==2008)]
result=summer_2008[['Team','Age']].groupby('Team').mean()
result.sort_values(by='Age')

                              Age
Team
Somalia                 17.500000
Cambodia                18.000000
Laos                    19.000000
Suriname                19.000000
Malawi                  19.000000
...                           ...
Tonga                   29.666667
Fiji                    30.833333
Liechtenstein           31.500000
Boliva                  32.428571
Bosnia and Herzegovina  32.428571

[201 rows x 1 columns]

### Q.10
On average, which sport has the tallest athletes? The smallest? The heaviest? The least heavy?

In [91]:
new_df=df.dropna(subset=['Height','Weight'])
result=new_df[['Sport','Height','Weight']].groupby('Sport').mean()
print(result.sort_values(by='Height'))
print('Gymnastics on average has the shortest athletes, while basketball has the tallest')

                               Height     Weight
Sport
Gymnastics                 162.875641  56.913675
Trampolining               166.563758  59.322148
Diving                     166.662196  60.577000
Rhythmic Gymnastics        167.795122  48.760976
Weightlifting              167.822726  79.547651
Figure Skating             168.148810  59.543651
Synchronized Swimming      168.489988  55.856302
Softball                   169.428571  67.471655
Short Track Speed Skating  170.108199  64.310484
Freestyle Skiing           170.940854  67.026835
Table Tennis               171.253773  64.915036
Wrestling                  172.389440  75.508578
Boxing                     172.788475  65.243842
Art Competitions           172.821429  74.607143
Snowboarding               173.043290  69.527056
Archery                    173.250531  70.010616
Cross Country Skiing       173.261314  65.879496
Hockey                     173.387899  69.164869
Alpine Skiing              173.517666  72.084937
Shooting                   173.526784  74.025551
Triathlon                  173.640684  61.817490
Rugby                      173.666667  77.533333
Lacrosse                   174.000000  66.500000
Golf                       174.046296  71.194444
Biathlon                   174.052004  66.631419
Speed Skating              174.096935  70.034620
Judo                       174.157210  78.784131
Curling                    174.168293  72.131707
Badminton                  174.220264  68.171439
Equestrianism              174.397101  67.803975
Rugby Sevens               175.363636  79.006734
Football                   175.387467  70.449139
Cycling                    176.162425  70.068679
Skeleton                   176.224138  74.166667
Athletics                  176.259580  69.254974
Ski Jumping                176.489837  65.079014
Nordic Combined            176.519700  66.905722
Luge                       176.655047  77.282498
Taekwondo                  176.750000  68.088087
Fencing                    177.298318  71.387538
Modern Pentathlon          178.101507  70.279540
Sailing                    178.263763  75.972062
Canoeing                   178.552072  76.492072
Swimming                   178.590072  70.588104
Tennis                     178.915837  70.802291
Ice Hockey                 178.923127  80.837737
Motorboating               181.000000  77.000000
Bobsleigh                  181.604261  89.153445
Baseball                   182.599291  85.718085
Tug-Of-War                 182.727273  91.636364
Handball                   183.411094  81.497151
Rowing                     184.262638  80.168142
Water Polo                 185.028267  84.566446
Beach Volleyball           186.202602  79.089219
Volleyball                 186.978944  78.900214
Basketball                 191.208980  85.782585
Gymnastics on average has the shortest athletes, while basketball has the tallest

In [92]:
print(result.sort_values(by='Weight'))
print('Rhythmic gymnastics on average has the lightest athletes, while tug-of-war has the heaviest')

                               Height     Weight
Sport
Rhythmic Gymnastics        167.795122  48.760976
Synchronized Swimming      168.489988  55.856302
Gymnastics                 162.875641  56.913675
Trampolining               166.563758  59.322148
Figure Skating             168.148810  59.543651
Diving                     166.662196  60.577000
Triathlon                  173.640684  61.817490
Short Track Speed Skating  170.108199  64.310484
Table Tennis               171.253773  64.915036
Ski Jumping                176.489837  65.079014
Boxing                     172.788475  65.243842
Cross Country Skiing       173.261314  65.879496
Lacrosse                   174.000000  66.500000
Biathlon                   174.052004  66.631419
Nordic Combined            176.519700  66.905722
Freestyle Skiing           170.940854  67.026835
Softball                   169.428571  67.471655
Equestrianism              174.397101  67.803975
Taekwondo                  176.750000  68.088087
Badminton                  174.220264  68.171439
Hockey                     173.387899  69.164869
Athletics                  176.259580  69.254974
Snowboarding               173.043290  69.527056
Archery                    173.250531  70.010616
Speed Skating              174.096935  70.034620
Cycling                    176.162425  70.068679
Modern Pentathlon          178.101507  70.279540
Football                   175.387467  70.449139
Swimming                   178.590072  70.588104
Tennis                     178.915837  70.802291
Golf                       174.046296  71.194444
Fencing                    177.298318  71.387538
Alpine Skiing              173.517666  72.084937
Curling                    174.168293  72.131707
Shooting                   173.526784  74.025551
Skeleton                   176.224138  74.166667
Art Competitions           172.821429  74.607143
Wrestling                  172.389440  75.508578
Sailing                    178.263763  75.972062
Canoeing                   178.552072  76.492072
Motorboating               181.000000  77.000000
Luge                       176.655047  77.282498
Rugby                      173.666667  77.533333
Judo                       174.157210  78.784131
Volleyball                 186.978944  78.900214
Rugby Sevens               175.363636  79.006734
Beach Volleyball           186.202602  79.089219
Weightlifting              167.822726  79.547651
Rowing                     184.262638  80.168142
Ice Hockey                 178.923127  80.837737
Handball                   183.411094  81.497151
Water Polo                 185.028267  84.566446
Baseball                   182.599291  85.718085
Basketball                 191.208980  85.782585
Bobsleigh                  181.604261  89.153445
Tug-Of-War                 182.727273  91.636364
Gymnastics on average has the shortest athletes, while basketball has the tallest

### Q.11
How many different "Event" (individual Olympic competition name) mention the word "Men"? the word "Women"? neither "Men" nor "Women"?

In [116]:
unique_events= df['Event'].unique()
events_men=0
for n in unique_events:
    if (" Men" in n)==True:
       events_men= events_men+1
print(f'{events_men} different events mention the word "men"')

events_women=0
for n in unique_events:
    if ("Women" in n)==True:
       events_women= events_women+1
print(f'{events_women} different events mention the word "women"')

events_neither=0
for n in unique_events:
    if (" Men" in n)==False&("Women" in n)==False:
       events_neither= events_neither+1
print(f'{events_neither} different events mention neither the word "men" nor the word "women"')

463 different events mention the word "men"
211 different events mention the word "women"
302 different events mention neither the word "men" nor the word "women"

### Q.12

**1.** Select all rows in the DataFrame `df` which correspond to a summer olmypics game. Assign the result to a variable named `summer`.

In [118]:
summer = df.loc[df.Season=='Summer']

**2.** Create 4 new columns on the DataFrame `summer`: "Gold", "Silver", "Bronze", "Any_Medal", which record for each row (athelet-event) if the athelet has won a gold medal, silver medal, bronze medal, or any medal (with boolean variable `True`/`False`).

For example, if these columns are correctly created,
- `summer.loc[0,'Any_Medal']` should return `False`. (The athelete A Dijiang hasn't won any medal for Men's Basketball of the 1992 Summer Olympics).
- `summer.loc[3,'Gold']` should return `True`. (The athelete Edgar Lindenau Aabye has won a gold medal for Men's Tug-Of-War of the 1900 Summer Olympics).

In [132]:
def gold(x):
    if x=='Gold': 
        return True
    else:
        return False
summer['Gold']=summer['Medal'].apply(gold)
def silver(x):
    if x=='Silver': 
        return True
    else:
        return False
summer['Silver']=summer['Medal'].apply(silver)
def bronze(x):
    if x=='Bronze': 
        return True
    else:
        return False
summer['Bronze']=summer['Medal'].apply(bronze)
def any_medal(x):
    if x in ['Gold', 'Silver', 'Bronze'] : 
        return True
    else:
        return False
summer['Any_Medal']=summer['Medal'].apply(any_medal)
summer.head()

C:\Users\user\AppData\Local\Temp\ipykernel_15196\1657091419.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  summer['Gold']=summer['Medal'].apply(gold)
C:\Users\user\AppData\Local\Temp\ipykernel_15196\1657091419.py:12: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  summer['Silver']=summer['Medal'].apply(silver)
C:\Users\user\AppData\Local\Temp\ipykernel_15196\1657091419.py:18: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  summer['Bronze']=summer['Medal'].apply(bronze)
C:\Users\user\AppData\Local\Temp\ipykernel_15196\1657091419.py:24: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  summer['Any_Medal']=summer['Medal'].apply(any_medal)

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal,Gold,Silver,Bronze,Any_Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN,False,False,False,False
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN,False,False,False,False
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN,False,False,False,False
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold,True,False,False,True
26,8,"Cornelia ""Cor"" Aalten (-Strannood)",F,18.0,168.0,NaN,Netherlands,NED,1932 Summer,1932,Summer,Los Angeles,Athletics,Athletics Women's 100 metres,NaN,False,False,False,False

In [133]:
#check-up
summer.loc[0,'Any_Medal']

False

In [134]:
#check-up
summer.loc[3,'Gold']

True

**3.** Create a new DataFrame named `team_medals_by_year` which record the medal table for each country for each Summer Olympics.  

The 5 last rows should look like this:

| Team | Year | Gold | Silver | Bronze | Total |
| --- | --- | --- | --- | --- | --- |
|Zimbabwe | 2000 | 0 | 0 | 0 | 0 |
|Zimbabwe | 2004 | 1 | 1 | 1 | 3 |
|Zimbabwe | 2008 | 1 | 3 | 0 | 4 |
|Zimbabwe | 2012 | 0 | 0 | 0 | 0 |
|Zimbabwe | 2016 | 0 | 0 | 0 | 0 |

> **Hint**: You may need `.groupby(['Team','Year']).sum().reset_index()`.

In [136]:
team_medals_by_year = summer.groupby(['Team','Year']).sum().reset_index()
print(team_medals_by_year)

             Team  Year       ID    Age  Height  Weight  Gold  Silver  Bronze  \
0     Afghanistan  1936  1080368  364.0     0.0     0.0     0       0       0
1     Afghanistan  1948  1747096    0.0     0.0     0.0     0       0       0
2     Afghanistan  1956  1066944    0.0     0.0     0.0     0       0       0
3     Afghanistan  1960  1422051  373.0  2731.0  1111.0     0       0       0
4     Afghanistan  1964   559889  154.0   322.0   257.0     0       0       0
...           ...   ...      ...    ...     ...     ...   ...     ...     ...
2764     Zimbabwe  2000  1612153  649.0  4474.0  1777.0     0       0       0
2765     Zimbabwe  2004   621920  351.0  2489.0   987.0     1       1       1
2766     Zimbabwe  2008   715219  417.0  2407.0   892.0     1       3       0
2767     Zimbabwe  2012   524881  246.0  1570.0   587.0     0       0       0
2768     Zimbabwe  2016  2084831  852.0  5203.0  1928.0     0       0       0

      Any_Medal
0             0
1             0
2             0
3             0
4             0
...         ...
2764          0
2765          3
2766          4
2767          0
2768          0

[2769 rows x 10 columns]

> **Note**: For simplicity, we will count the number of athletes who have received medals. Indeed, for a 12-member basketball team, 12 athletes receive a gold medal, but on the real medal table this gold medal is counted only once. We won't worry about this problem here...

**4.** How many teams have never won a single medal at the Summer Olympic Games?

In [142]:
team_medals = summer.groupby(['Team']).sum().reset_index()
losers=team_medals[team_medals.Any_Medal==0]
print(losers)
losers.shape
print('71 teams have never won a single medal at the Summer Olympic Games')

                        Team        ID     Age   Height   Weight    Year  \
1                    Albania   4583008  1631.0   8635.0   3879.0  126092
3             American Samoa   2597544   936.0   3511.0   2027.0   70032
4                    Andorra   3328267  1448.0   8131.0   3210.0  105912
5                     Angola  15151663  6651.0  43660.0  18165.0  534100
6                    Antigua   8662879  3066.0  20139.0   7676.0  264892
..                       ...       ...     ...      ...      ...     ...
183              Timor-Leste    562771   204.0   1272.0    255.0   16088
189             Turkmenistan   3396638  1289.0   9182.0   3797.0  108356
197                  Vanuatu   2291202   842.0   5248.0   1875.0   70004
200  Virgin Islands, British   2760894  1092.0   6602.0   2877.0   83776
202                    Yemen   1564989  1037.0   6223.0   2338.0   95888

     Gold  Silver  Bronze  Any_Medal
1       0       0       0          0
3       0       0       0          0
4       0       0       0          0
5       0       0       0          0
6       0       0       0          0
..    ...     ...     ...        ...
183     0       0       0          0
189     0       0       0          0
197     0       0       0          0
200     0       0       0          0
202     0       0       0          0

[71 rows x 10 columns]
71 teams have never won a single medal at the Summer Olympic Games

**5.** Create a DataFrame named `team_mean_medals` which record for each contry the average number of gold, silver, bronze, total medals for their participations in the Summer Olympic games. Sort the DataFrame by the average number of gold medals in descending order.

The first rows should look like this:

| Team | Gold | Silver | Bronze | Total |
| --- |  --- | --- | --- | --- |
|USA | 88.285714 | 47.607143 | 42.750000 | 178.642857 |
|Russia | 61.000000 | 48.700000 | 49.700000 | 159.400000 |
|Germany | 41.346154 | 37.961538 | 40.923077 | 120.230769 |
|UK | 21.931034 | 25.137931 | 21.379310 | 68.448276 |
|Italy | 17.862069 | 16.344828 | 15.655172 | 49.862069 |

In [151]:
team_mean_medals = team_medals_by_year.groupby(['Team']).mean().reset_index().sort_values(by=['Gold'], ascending=False)
print(team_mean_medals[['Team','Gold','Silver','Bronze','Any_Medal']])

              Team       Gold     Silver     Bronze   Any_Medal
191            USA  88.285714  47.607143  42.750000  178.642857
151         Russia  61.000000  48.700000  49.700000  159.400000
67         Germany  41.346154  37.961538  40.923077  120.230769
190             UK  21.931034  25.137931  21.379310   68.448276
87           Italy  17.862069  16.344828  15.655172   49.862069
..             ...        ...        ...        ...         ...
101        Lesotho   0.000000   0.000000   0.000000    0.000000
1          Albania   0.000000   0.000000   0.000000    0.000000
103          Libya   0.000000   0.000000   0.000000    0.000000
104  Liechtenstein   0.000000   0.000000   0.000000    0.000000
102        Liberia   0.000000   0.000000   0.000000    0.000000

[205 rows x 5 columns]